{
    "traits": [
        {
            "Trait": "Abrasive",
            "Description": "Always says exactly what's on their mind, especially if it's bugging them. That tends to rub people the wrong way",
            "Conflicts": "Diplomat, Haggler, Kind, Master Diplomat, Master Trader, Sucker, Uncouth"
        },
        {
            "Trait": "Achillean",
            "Description": "They are said to have been dipped in the river of death, they seem invulnerable in battle\t",
            "Stats": "melee +2, shooting +2, immunity gain speed +100%, move speed +0.50, armor - blunt +80%, armor - sharp +80%"
        },
        {
            "Trait": "Aesthete",
            "Description": "Loves beautiful things, and really cares about how their environment looks\t",
            "Conflicts": "Ascetic"
        },
        {
            "Trait": "Amateur Haggler",
            "Description": "They like to haggle. They get better prices than most people",
            "Stats": "Trade price improvement +20%",
            "Conflicts": "Haggling Enthusiast, Persuasive, Sucker"
        },
        {
            "Trait": "Ambusher",
            "Description": "They are an Ambusher, a fighter that lies in cold wait for their enemies",
            "Stats": "Mental break threshold -16%, pain shock threshold -15%, move speed -0.25, melee hit chance +10, global work speed -10%",
            "Conflicts": "Bladesman, Blademaster, Bladedancer, Legendary Bladedancer, Gladiator, Faceless, Shartpshooter, Sniper, Master Sniper, Legendary Sniper, Woodsman, Hunter, Scout, Ranger, Psionic, Monk, Commander, Supersolder, Wayfarer, Physically Adept, Arcane Mage, Fire Mage, Ice Mage, Lightning Mage, Druid, Priest, Necromancer, Technomancer, Geomancer, Warlock, Succubus, Chaos Mage, Paladin, Summoner, Lich, Entertainer, Performer, Minstrel, Bard, Chronomancer, Enchanter, Blood Mage, Wanderer, Magically Gifted, Bright Mage, Shaman, Shadow,  Troubadour, Red Mage, Ninja, Elemental Gunner, Bombadier, Rail Breaker, Samurai, Gadgeteer, Wind Mage, Medic, Harbinger, Reaper, Beserker, Scion, Plague Doctor, Cleric, Saboteur, Keeper, Pride Stalker, Aspirant, Hawkeye, Atronach, Support Specialist, Scrapper"
        },
        {
            "Trait": "Ancient Dragon Aspect",
            "Description": "Has the aspect of an ancient dragon so they are considered bewitching to look at, or vast intellegence, but are still beasts at their core giving them an edge in survival, but also makes them territorial and extermely less tolerant of others",
            "Stats": "melee +3, melee hit chance +4, rest rate multiplier -33%, immunity gain speed +25%, mental break threshold -7%, trade price improvement +5%, social impact +10%, melee dodge chance +12, pain shock threshold +33%, global work speed -15%",
            "Conflicts": "Ancient Elder Dragon Manifestation, Dragon Attribute, Elder Dragon Characteristic"
        },
        {
            "Trait": "Ancient Elder Dragon Manifestation",
            "Description": "Has the manifestation of an ancient elder dragon so they are considered beyond bewitching to look at, of unending intellegence, but are mere beasts, they are almost beyond mortal limits almost guaranteeing survival, these beings will be territorial and will not tolerate others whom they are frustrated with",
            "Stats": "melee +4, melee hit chance +10, rest rate multiplier -67%, immunity gain speed +50%, mental break threshold -20%, trade price improvement +25%, social impact +25%, melee dodge chance +25, global learning factor +33%, pain shock threshold +50%, global work speed -20%",
            "Conflicts": "Ancient Dragon Aspect, Dragon Attribute, Elder Dragon Chracteristic"
        },
        {
            "Trait": "Android",
            "Description": "They are an android. As an android they are a bit faster and not really sensible for psychic phenomena",
            "Stats": "move speed +0.16, global work speed +30%, psychic sensitivity -75%, tosix sensitivity -75%, mental break threshold -90%"
        },
        {
            "Trait": "Animal Friend",
            "Description": "Has a special connection to animals and understands them better than most people. Animals also tendo to understand what they want from them. The time they spend with animals is long, but worth it",
            "Stats": "animal gather speed -50%, animal gather yield +20%",
            "Conflicts": "Silvertongue"
        },
        {
            "Trait": "Animal Hater",
            "Description": "Just isn't an 'animal person.' They don't like animals. And for the record, they don't seem to much like them either",
            "Stats": "Animals: -4, Animal gather speed: -10%, Animal gather yield: -20%, Tame animal: -40%, Train animal: -40%",
            "Conflicts": "Animal Lover"
        },
        {
            "Trait": "Animal Lover",
            "Description": "They love animals. They don't feel quite the same about people though",
            "Stats": "Animals +4, Social -2, Animal gather speed +10%, Animal gather yield +20%, Tame animal chance +40%, Train animal chance +40%, Social impact -40%",
            "Conflicts": "Animal Hater, Butcher"
        },
        {
            "Trait": "Annoying Voice",
            "Description": "Their voice has a particularly grating, nasal quality to it, and they tend to talk in barking, barbled phrases. This predisposes others to dislike them",
            "Conflicts": "Diplomat, Haggler, Master diplomat, Master Trader, Sucker, Uncouth"
        },
        {
            "Trait": "Aprhodite's Grace",
            "Description": "To behold that one look can inspire tears, desire, jealousy, and love",
            "Stats": "Social +8, Negotiation ability +100%, Social impact +100%, Trade price improvement +100%, Armor - Blunt +100%, Armor - Sharp +120%"
        },
        {
            "Trait": "Arbormancer",
            "Description": "A mage whose magic power is derived from living plants. They are not necessarily allies of the wood, however. They often earn the ire of Rangers and Druids through their wanton mistreatment of nature",
            "Stats": "toxic sensitivity -20%, plant work speed +50%, plant harvest yield +50%, animal gather yield -20%, tame animal chance -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Arcane Conduit",
            "Description": "Abnormally receptive to the ebb and flow of mana, they will gain mana 40% faster than normal but their max mana capacity is reduced by 20",
            "Conflicts": "Boundless, Mana Well"
        },
        {
            "Trait": "Arcane Mage",
            "Description": "Attuned with arcane forces, interacting directly with raw arcane power to move matter and energy at will",
            "Stats": "Research speed +10%, Global learning +20%, Mental break +3%, Social impact +10%, Negotiation ability +10%, Trade price improvement +10%, Psychic sensitivity +100%, Tame animal -20%, Train animal -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Architect",
            "Description": "Proficient with various construction materials, particularly stone. They will construct anything out of stone three times as fast as oehters and smooth out your rocky base in no time",
            "Stats": "smoothing speed +200%, construct success chance +10%"
        },
        {
            "Trait": "Ares' Wrath",
            "Description": "Feared by their enemies and worshiped by warriors, they are a bloodthursty embodiment of war",
            "Stats": "Melee +8, Shooting accuracy +1, Move speed +0.5, Melee hit chance +1, Armor - Blunt +100%, Armor - Sharp +120%"
        },
        {
            "Trait": "Artemis' Blessing",
            "Description": "Their natural instinct to protect and nurture the people led them to champion the hunt",
            "Stats": "shooting +8, hunting stealth +50%, shooting accuracy +1, aiming time -100%, butchery speed +100%, cooking speed +1, armor - blunt +100%, armor - sharp +120%, foraged food amount +1"
        },
        {
            "Trait": "Ascetic",
            "Description": "Has forsake physical comforts and enjoyments in favor of a simple, pure lifestyle. They will become unhappy if they have a bedroom that's too impressive. They also dislike fancy food and prefers to eat raw. They never judge others by their appearance",
            "Stats": "Artsitic meditation focus type disabled, Minimal meditation focus type allowed",
            "Conflicts": "Greedy, Jealous, Gourmand, Aesthete"
        },
        {
            "Trait": "Asexual",
            "Description": "Has no sexual attraction to anyone at all",
            "Conflicts": "Bisexual, Gay, Polyamorous, Straight"
        },
        {
            "Trait": "Aspirant",
            "Description": "A fledgling fighter with incredible potential",
            "Stats": "animals -6, artistic -6, construction -6, cooking -6, crafting -6, medical -6, melee -6, mining -6, intellectual -6, plants -6, shooting -6, social -6, move speed +1, global learning factor +100%, global work speed +40%, eating speed x200%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Athletic",
            "Description": "They have honed their mind and body for most of their life",
            "Stats": "Melee +2, Shooting +2, Construction +1, Move speed +0.35, Global work speed +25%, Aiming time -10%, Shooting accuracy +0.1",
            "Conflicts": "Overweight"
        },
        {
            "Trait": "Atronach",
            "Description": "An anomaly among spellcasters. They are capable of casting some powerful spells, but they are completely out of tune with the flow of magic and do not regenerate mana, they must find their own sources of mana with which to fuel their spells",
            "Stats": "psychic sensitivity -100%, mental break threshold -18%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Awkward",
            "Description": "The elephant in the room",
            "Stats": "Social impact -20%",
            "Conflicts": "Melodic Voice, Tucker"
        },
        {
            "Trait": "Bard",
            "Description": "They are a master entertainer. Sharp wit, deft hands, and a dry humor are their weapons and they are a master of all their weapons",
            "Stats": "Social impact +35%, Negotiation ability +40%, Trade price improvement +25%, Pain shock threshold -15%, Carrying capacity -20, Global work speed -15%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Beautiful",
            "Description": "They are exceptionally beautiful, with an exotic-yet-familiar facial structure and an arresting gaze. People are attracted to them before they even open their mouth",
            "Stats": "beauty +2",
            "Conflicts": "Pretty, Staggeringly Ugly, Ugly"
        },
        {
            "Trait": "Berserker",
            "Description": "A rampaging warrior who lives to kill or be killed",
            "Stats": "move speed +0.6, melee hit chance +15, melee dodge chance -15, shooting accuracy -15, pain shock threshold +100%, psychic sensitivity -50%, mental break threshold +12%, social impact -50%, negotiation ability -25%, carrying capacity +120, global learning factor -25%, global work speed -25%, immunity gain speed +100%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Bisexual",
            "Description": "Romantically attracted to both men and women",
            "Conflicts": "Asexual, Gay, Straight"
        },
        {
            "Trait": "Bladedancer",
            "Description": "They are a blade dancer, highly skilled in melee combat. Watching them fight is like watching a dance, every action precise and flawless as it flows from one form into another",
            "Stats": "Move speed +0.3, Mental break -8%, Melee hit +10%, Melee dodge +15, Pain shock threshold +5%, Shooting accuracy -28, Global work speed -6%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Blademaster",
            "Description": "They are trained to become a sword master, dangerously skilled in melee combat",
            "Stats": "Move speed +0.2, Mental break threshold -5%, Melee hit +6, Melee dodge +10, Shooting accuracy -25, Global work speed -8%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Bladesman",
            "Description": "They are training to become a master of the blade and excels at fighting in melee combat",
            "Stats": "Move speed +0.15, Mental break threshold -3%, Melee hit +3, Melee dodge +5, Shooting accuracy -20, Global work speed -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Bleeding Heart",
            "Description": "Has a big heart and gets very emotional. They love helping people, and abhors violence and injustice. They are more affected by these things than other people",
            "Conflicts": "Psychopath, Bloodlust, Cannibal, Desensitized"
        },
        {
            "Trait": "Blood Mage",
            "Description": "They are a blood mage and have consigned to the dark art of manipulating the life blood of living things as a means of increasing their power., As a blood mage, they have learned to control the life force within and command it at their will. Their connection to life makes it easier to associate with other living things, but doesn't appreciate effort without immediate results",
            "Stats": "Social impact +20%, Negotiation ability +15%, Trade price improvement +10%, Tame animal +15%, Train animal +10%, Global learning factor -20%, Research speed -30%, Immunity gain +10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Bloodlust",
            "Description": "They get a rush from hurting people, and never minds the sight of blood or death. They are four times as likely to start a social fight as others"
        },
        {
            "Trait": "Body Purist",
            "Description": "They believe the human body is limited for a reason. To them, artificial body parts are unethical and disgusting",
            "Conflicts": "Transhumanist"
        },
        {
            "Trait": "Bombadier",
            "Description": "A fighter specializing in long-range explosive weaponry. They are experts at siege warfar, and can fire explosives over walls from behind cover",
            "Stats": "shooting accuracy +5",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Boundless",
            "Description": "Excels at combat arts and is able to execute combat maneuvers 40% more frequently, however, their talent has fostered an arrogane attitude that reduces their experience gain by 25% and causes other fighres to dislike them\t",
            "Conflicts": "Arcane Conduit, Mana Well"
        },
        {
            "Trait": "Brawler",
            "Description": "They like to fight up close and personal. Their accuracy is greatly increased in melee combat, but they'll be unhappy if asked to carry a ranged weapon",
            "Stats": "Melee: +4, Shooting: -4, Melee hit +4",
            "Conflicts": "Careful Shooter, Trigger-happy, Deadshot, Expert Shooter, Wimp"
        },
        {
            "Trait": "Brightmage",
            "Description": "Able to harness the powers of light to purge evil. They approach any task with an unrivaled fervor that usually places them at the forefront. Being a Brightmage introduces a dependency on the sun and light, because of this, They have developed an intense hatred for shadowy and dark caricatures",
            "Stats": "psychic sensitivity +15%, move speed +0.2, melee dodge chance +10, global work speed +10%, aiming time -25%, shooting accuracy -35, social impact +10%, tosic sensitivity +30%, cerrying capacity -30, pain shock threshold -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Brown Thumb",
            "Description": "They are a terrible gardener. The only thing they seem able to grow is weeds",
            "Stats": "Plants: -2, Plant harvest yield - 15%, Plant work speed -15%",
            "Conflicts": "Coordinated, Green Thumb, Inept"
        },
        {
            "Trait": "Builder",
            "Description": "Loved playing with construction toys as a child, and still enjoys the thrill of 'putting things together.' They tend to be a bit lost without clear instructions to follow",
            "Stats": "Artistic -2, Construction +2, Construction speed +20%, Construction success +20%, Tame animal -40%",
            "Conflicts": "Coordinated, Inept"
        },
        {
            "Trait": "Butcher",
            "Description": "Enjoys prepating meat for cooking. Their butchering speed is greatly increased, but only if they're dealing with animal corpses. They're terrible with mechanoids",
            "Stats": "Cooking +2, Butchery efficiency +20%, Butchery speed +40%, Mechanoid disassembly efficiency -20%, Mechanoid disassembly speed -40%",
            "Conflicts": "Animal Lover, Coordinated, Inept"
        },
        {
            "Trait": "Cannibal",
            "Description": "They were taught that eating human meat is wrong and horrible. But one time, long ago, they tried it... and they liked it"
        },
        {
            "Trait": "Careful Shooter",
            "Description": "Takes more time to aim when shooting. They shoot less often than others, but with more accuracy",
            "Stats": "aiming time +25%, shooting accuracy +3",
            "Conflicts": "Brawler, Cranial nerve palsy, Deadshot, Eagle-eyed, Expert shooter, Trigger-happy"
        },
        {
            "Trait": "Careful Surgeon",
            "Description": "They take medicine very seriously. They want to do no harm and aren't afraid to take longer to do the job right",
            "Stats": "Medical +1, Medical operation speed +20%, Medical tend speed +20%, Medical surgery success +60%, Medical tend quality +30%"
        },
        {
            "Trait": "Chain Warden",
            "Description": "A fighter that has mastered the usage of chains as a combat weapon. They excel at controlling enemy movements and dealing with multiple opponents at once",
            "Stats": "melee hit chance +10, mental break threshold -12%, pain shock threshold +15%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Chaos Mage",
            "Description": "They have rejected all predefined magic paths and refuses to attribute objective reality in their search for power; there are no truths, all magic is permitted. This tradition has enabled them to learn and type of magic, although they will never master any",
            "Stats": "Global learning factor +25%, Research speed -20%, Global work speed -10%, Psychic sensitivity +50%, Immunity gain speed -5%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Chatty",
            "Description": "Just talks and talks and talks... and talks. They tend to have longer conversations than most, because they can't seem to end them"
        },
        {
            "Trait": "Chemical Fascination",
            "Description": "They have an intense fascination with chemical sources of enjoyment. They will consume much more of them and, if not already addicted to any drugs and satisfied, will sometimes go on hard drug binges. They will ignore directives to not use pleasurable drugs",
            "Conflicts": "Chemical Interest, Teetotaler"
        },
        {
            "Trait": "Chemical Interest",
            "Description": "They have an unusual interest in chemical sources of enjoyment. They will consume more of them and, if not already addicted to any drug and satisfied, will sometimes go on social drug binges. They will ignore directives to not use pleasurable drugs",
            "Conflicts": "Chemical Fascination, Teetotaler"
        },
        {
            "Trait": "Chroma Mage",
            "Description": "A versatile spellcaster capable of undertaking numerous paths of mastery. They can learn any of several powerful spells, but they will never master them all",
            "Stats": "move speed +0.25, global learning factor +20%, research speed +50%, global work speed +40%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Chronomancer",
            "Description": "They are a chronomancer. Through arcane sight, they are able to view reality as it once was and as it could be, and can manipulate objects between those realities",
            "Stats": "Global learning factor +25%, Research speed +40%, Global work speed -20%, Pain shock threshold -10%, Psychic sensitivity +10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Claustrophobic",
            "Description": "They are claustrophobic. They are terrified of tight spaces, and thus are not a very competent miner",
            "Stats": "Mining -2, Mining speed -20%, Mining yield -20%",
            "Conflicts": "Coordinated, Inept, Rockhound"
        },
        {
            "Trait": "Clean",
            "Description": "Fastidious to a fault",
            "Stats": "Cooking +1, Global work speed -25%, Food poison chance -50%, Immunity gain speed +20%, Medical surgery success +20%, Medical tend quality +20, Medical operation speed +20%, Medical tend speed +20%"
        },
        {
            "Trait": "Cleric",
            "Description": "A versatile mid-line healer capable of quickly healing and cleansing their allies",
            "Stats": "move speed +0.25, aiming time -30%, shooting accuracy +3",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Codependent",
            "Description": "Romantically needed and won't be happy unless in a relationship. They will be devastated by infidelity and breakups",
            "Conflicts": "Lecher, Polyamorous"
        },
        {
            "Trait": "Cold Lover",
            "Description": "Loves cold temperatures. They'll complain less than others when it's chilly, but will whine more when it's hot",
            "Stats": "Max comfortable temp -3C[-5.4F], Min comfortable temp -5C [-9F]",
            "Conflicts": "Heat Lover"
        },
        {
            "Trait": "Commander",
            "Description": "As a commander, they exhibit a charismatic personality and stalwart presence that makes other pawns want to follow their lead. Commander's utilize the weight of their presence to inspire nearby pawns, and when that's not enough, they can issue orders that drive their followers to victory. Because they are used to everyong doing their bidding, they consider menial tasks beneath them and are lackluster workers",
            "Stats": "Social impact +40%, Negotiation ability +30%, Carrying capacity -20, Global work speed -30%, Research speed -40%\t",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Confident",
            "Description": "They are confident that everything will work out for the best",
            "Stats": "Social +2, Mental break threshold -6%"
        },
        {
            "Trait": "Coordinated",
            "Description": "Unusually coordinated and good at most any skilled labor",
            "Stats": "Artistic +2, Construction +2, Cooking +2, Crafting +2, Mining +2, Global work speed +20%, Animal gather speed +10%, Animal gather yield +10%, Butchery efficiency +10%, Butchery speed +10%, Mechanoid disassembly efficiency +10%, Mechanoid disassembly speed +10%, Construction speed +10%, Construction success chance +10%, Cooking speed +0.1, Repair success chance +10%, Food poison chance -10%, Mining speed +10%, mining yield +10%, Plant harvest yield +10%, Plant work speed +10%, General labor speed +10%",
            "Conflicts": "builder, butcher, claustrophobic, gourmet, hard worker, industrious, inept, lazy, perfectionist, rockhound, savant, slothful"
        },
        {
            "Trait": "Cranial Nerve Palsy",
            "Description": "Has a hard time seeing things clearly",
            "Stats": "Shooting accuracy -4, Melee hit chance -4, Global work speed +20%",
            "Conflicts": "careful shooter, deadshot, eagle-eyed, expert shooter, trigger-happy"
        },
        {
            "Trait": "Creative Thinker",
            "Description": "Has a unique approach to science. They always think outside the box and find inspiration for intellectual problems in art",
            "Stats": "Artistic increases research speed"
        },
        {
            "Trait": "Creepy Breathing",
            "Description": "They breathe heavily all the time, and sweats constantly. People find it creepy",
            "Conflicts": "Diplomat, Haggler, Master Diplomat, Master Trader, Sucker, Uncouth"
        },
        {
            "Trait": "Deadshot",
            "Description": "Knows how to handle a firearm, and can shoot both quickly and accurately",
            "Stats": "shooting +2, aiming time -50%, shooting accuracy +4",
            "Conflicts": "brawler, careful shooter, cranial nerve palsy, eagle-eyed, expert shooter, trigger-happy"
        },
        {
            "Trait": "Death Knight",
            "Description": "They are a Death Knight - harbinger of doom and a representative of the ever approaching inevitability of death and decay. Her solemn attitude makes most pawns uneasy and even fewer approve of their methods",
            "Stats": "Social impact -25%, Negotiation ability -20%, Carrying capacity +30, Pain shock threshold +30%, Psychic sensitivity -25%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Decent Learner",
            "Description": "Has always picked up skills pretty quickly",
            "Stats": "Global learning factor +25%",
            "Conflicts": "Too Smart"
        },
        {
            "Trait": "Deftly Dodger",
            "Description": "Has cat-like reflexes, and excels at evading attacks",
            "Stats": "melee dodge chance +20"
        },
        {
            "Trait": "Deep Sleeper",
            "Description": "Can sleep through anything"
        },
        {
            "Trait": "Depressive",
            "Description": "They are perenially unpahhy. They have trouble sustaining a good mood even when everything is fine",
            "Stats": "Permanent mood effect -12",
            "Conflicts": "Optimist, Pessimist, Sanguine"
        },
        {
            "Trait": "Desensitized",
            "Description": "Has seen enough violence and death that it no longer shocks them like it used to",
            "Conflicts": "Bleeding Heart, Psychopath, Bloodlust"
        },
        {
            "Trait": "Dexterous",
            "Description": "Demonstrates neat skill, especially with their hands",
            "Stats": "Crafting +2, Artistic +2, Global work speed +25%, Aiming time -10%"
        },
        {
            "Trait": "Diplomat",
            "Description": "Knows how to grease the wheels of diplomacy",
            "Stats": "Social +2, Negotiation ability +15%, Social impact +20%",
            "Conflicts": "Abrasive, Annoying Voice, Creepy Breathing, Master Diplomat, Uncouth"
        },
        {
            "Trait": "Diplomatic",
            "Description": "They know how to grease the wheels of diplomacy",
            "Stats": "Negotiation ability +20%",
            "Conflicts": "Uncouth, Very Diplomatic"
        },
        {
            "Trait": "Dislikes Children",
            "Description": "They dislike children"
        },
        {
            "Trait": "Dragon Attribute",
            "Description": "Has the traits of a dragon so they are considered very good to look at, intellegent, but are still beasts at their core giving them an edge in survival, but also makes them territorial and less tolerant of others",
            "Stats": "melee +1, rest rate multiplier -10%, immunity gain speed +5%, melee dodge chance +4, global learning factor +5%, global work speed -5%",
            "Conflicts": "Ancient Dragon Aspect, ancient elder dragon manifestation, elder dragon chracteristic"
        },
        {
            "Trait": "Druid",
            "Description": "They are attuned with the forces of nature",
            "Stats": "Immunity gain speed +15%, Toxic sensitivity -20%, Plant work speed +25%, Plant harvest yield +25%, Social impact -10%, Negotiation ability -10%, Trade price improvement -10%, Animal gather yield +20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Dunce",
            "Description": "Is a bit of a dunce, and learns at a slower rate than others",
            "Stats": "Intellectual -4, Global learning factor -25%, Research speed -20%",
            "Conflicts": "Fast Learner, Inventor, Savant, Too Smart"
        },
        {
            "Trait": "Eagle-Eyed",
            "Description": "Has a keen eye and can quickly spot targets",
            "Stats": "Shooting +2, Melee hit chance +1, Shooting accuracy +5",
            "Conflicts": "Careful Shooter, Trigger-happy, Deadshot, Expert Shooter, cranial nerve palsy"
        },
        {
            "Trait": "Efficient Builder",
            "Description": "Doesn't like to waste materials. They take great care in their work",
            "Stats": "Construction +1, Construction speed -10%, Construct success chance +150%"
        },
        {
            "Trait": "Elder Dragon Characteristic",
            "Description": "Has the characteristics of an elder dragon so they are considered extremely good to look at, of superior intellegence, but are still beasts at their core giving them an edge at survival, but also makes them terrirotial and less tolerant of others",
            "Stats": "melee +2, melee hit chance +2, rest rate multiplier -20%, immunity gain speed +15%, mental break threshold -3%, social impact +5%, melee dodge chance +8, global learning factor +5%, pain shock threshold +10%, global work speed -10%",
            "Conflicts": "Ancient Dragon Aspect, Ancient Elder Dragon Manifestation, Dragon Attribute"
        },
        {
            "Trait": "Elemental Gunner",
            "Description": "A magically-gifted pawn capable of imbuing their ammunition with magical power. Their magically-heightened awareness allows them to shoot at frieghtening speeds. They specialize in laying down sustained suppressive fire",
            "Stats": "move speed +0.25, aiming time -50%, shooting accuracy +5, global work speed +16%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Enchanter",
            "Description": "They are an enchanter, attuned to the composition of matter and materials. They can manipulate matter to their will, frequently in unnatural ways, and their powers of transmutation can be permanent when sufficient effor is applied",
            "Stats": "Tame animal -15%, Train animal -15%, Global learning factor +10%, Global work speed +10%, Min comfortable temp +5.4F [3.0C], Max comfortable temp -5.4F [-3.0C], Toxic sensitivity +10%, Immunity gain speed -3%, Pain shock threshold -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Entertainer",
            "Description": "They are a natural entertainer, able to lighten the mood and lift the spirits of everyone around them",
            "Stats": "Social impact +10%, Negotiation ability +20%, Trade price improvement +10%, Pain shock threshold -10%, Carrying capacity -10, Global work speed -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Expert Shooter",
            "Description": "Has had proper training with ranged weapons. They shoot accurately and quickly",
            "Stats": "aiming time -25%, shooting accuracy +2.5",
            "Conflicts": "Brawler, Cranial Nerve Palsy, Eagle-eyed"
        },
        {
            "Trait": "Faceless",
            "Description": "They are a master of disguise and imitation; able to manipulate and capture the muscle and mental actions of another and release it as their own",
            "Stats": "Move speed +0.15, Global work speed +10%, Immunity gain speed +10%, Psychic sensitivity +50%, Mental break threshold +10%, Global learning factor +20%, Melee dodge +4, Mining speed -10%, Plant work speed -10%, Research speed -40%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Fast Learner",
            "Description": "They have a knack for learning. They pick things up much faster than others",
            "Stats": "global learning factor +75%, global work speed -10%",
            "Conflicts": "Dunce, Savant, Too Smart"
        },
        {
            "Trait": "Fast Miner",
            "Description": "They know how to exploit the cleavage of rocks. They don't understand why plants are so much more fragile though",
            "Stats": "Mining +1, Mining speed +50%, Smoothing speed +50%, Plant harvest yield -75%"
        },
        {
            "Trait": "Fast Walker",
            "Description": "They like to be where they're going. They walk quicker than most people\t",
            "Stats": "move speed +0.4",
            "Conflicts": "Jogger, Slowpoke"
        },
        {
            "Trait": "Fire Mage",
            "Description": "They are attuned with the elements of fire",
            "Stats": "Move speed +0.2, Global work speed +10%, Immunity gain speed +40%, Psychic sensitivity +20%, Mental break threshold +6%, Shooting accuracy -5, Max comfortable temp +27F [15C], Min comfortable temp +12.6F [7.0C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Fisherman",
            "Description": "Enjoys the solitude and tranquility inherent to long fishing sessions. They will prefer fishing above other activities"
        },
        {
            "Trait": "Fortunate",
            "Description": "Seems to have rented all the good fortune on this Rimworld",
            "Stats": "mining yield +10%, animal gather yield +20%, plant harvest yield +10%"
        },
        {
            "Trait": "Gadgeteer",
            "Description": "They're a gadgeteer, an eccentric inventor who carries around numberous gadgets and tools to assist them in daily life",
            "Stats": "social impact -25%, pain shock threshold -10%, move speed -0.5, research speed +60%, global learning factor +40%, global work speed -20%, mental break threshold +8%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Gay",
            "Description": "They are romantically attracted to people of their own gender",
            "Conflicts": "Asexual, Bisexual, Straight"
        },
        {
            "Trait": "Genius Inventor",
            "Description": "Strange new ideas just appear in their mind. Researching new technology comes easily to them, but they always seem distracted",
            "Stats": "Intellectual +1, Research speed +70%, Global work speed -20%, Move speed -0.1, Psychic sensitivy +10%, Mental break threshold +10%"
        },
        {
            "Trait": "Geomancer",
            "Description": "They are attuned with the earth and natural order, drawing power from the physical realm and intertwining it with arcane energy. They are capable of reinforcing physical elements, and bending them, as they need",
            "Stats": "Move speed -0.1, Toxic sensitivity -30%, Min comfortable temp -21.6F [-12C], Max comfortable temp +21.6F [12C], Melee dodge -5, Mining speed +25%, Mining yield +25%, Carrying capacity +20, Global work speed -20%, Mental break threshold -15%, Global learning factor -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Gladiator",
            "Description": "They have learned how to train the Gladiator combat style",
            "Stats": "Move speed +0.2, Global work speed +20%, Immunity gain speed +20%, Psychic sensitivity -60%, Mental break threshold -3%, Global learning factor -30%, Melee dodge +4, Mining speed +20%, Mining yield +20%, Plant work speed -25%, Plant harvest yield -20%, Research speed -25%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Glutton",
            "Description": "Some people use a spoon to eat... They use a shovel",
            "Stats": "Eating speed +25%",
            "Conflicts": "Nibbler"
        },
        {
            "Trait": "Gourmand",
            "Description": "Their life revolves around food. They get hungry quickly, and will occasionally be overcome with the urge to eat ravenously, even when not hungry",
            "Stats": "Cooking +4, Hunger rate multiplier +50%",
            "Conflicts": "Ascetic"
        },
        {
            "Trait": "Gourmet",
            "Description": "They are always a critic when it comes to food. They expect to be fed will and will complain if their meals aren't up to par",
            "Conflicts": "Cooridnated, Inept"
        },
        {
            "Trait": "Great Memory",
            "Description": "They have a fantastic memory for detail. They will learn new skills slightly faster than other people",
            "Stats": "Global learning factor +25%"
        },
        {
            "Trait": "Greedy",
            "Description": "They need a really impressive bedroom. They get a mood loss if they don't get what they want",
            "Conflicts": "Ascetic, Jealous"
        },
        {
            "Trait": "Green Thumb",
            "Description": "They have a passion for gardening. They know exactly what a plant needs to grow happily",
            "Stats": "Plants +1, Plant work speed +50%, Plant harvest yield +150%",
            "Conflicts": "Brown Thumb, Coordinated, Inept, Rockhound"
        },
        {
            "Trait": "Gunnut",
            "Description": "Is a gun nut, his life revolves around guns, how they are crafted, maintained and used. Quite a handy skill in these circumstances. Just don't hadn them a melee weapon",
            "Stats": "shooting +2, crafting +2, aiming time -10%",
            "Conflicts": "Brawler"
        },
        {
            "Trait": "Haggler",
            "Description": "Likes to haggle, and isn't bad at it. They tend to get better prices than most people",
            "Stats": "Social +2, Trade price improvement +20%",
            "Conflicts": "Abrasive, Annoying Voice, Creepy Breathing, Master Trader, Sucker"
        },
        {
            "Trait": "Haggling Enthusiast",
            "Description": "They always get the best deals - so much so that others often fail to realize they're being duped",
            "Stats": "Trade price improvement+40%",
            "Conflicts": "Amateur Haggler, Persuasive, Sucker"
        },
        {
            "Trait": "Hand-eye Coordination",
            "Description": "Exceptionally coordinated with his hands",
            "Stats": "global work speed +15%, aiming time -10%, melee hit chance +5"
        },
        {
            "Trait": "Harbinger",
            "Description": "A mage whose presence always signals death and destruction. They are capable of tapping into dark forces to curse their enemies, corrupting their body and soul",
            "Stats": "move speed -0.5, trade price improvement -20%, negotiation ability -20%, social impact -50%, research speed +30%, global learning factor +30%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Hard Worker",
            "Description": "They are a natural hard worker and will finish tasks faster than most",
            "Stats": "Global work speed +20%, joy need rate multiplier +10%",
            "Conflicts": "coordinated, industrious, inept, lazy, perfectionist, slothful"
        },
        {
            "Trait": "Hates Humanity",
            "Description": "Has a deep hatred toward all of humanity, seeing them as nothing more than egotistical meatbags",
            "Conflicts": "loves humanity"
        },
        {
            "Trait": "Hawkeye",
            "Description": "A fighter that has dedicated their life to the mastery of the bow",
            "Stats": "aiming time -25%, shooting accuracy +5",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Heat Lover",
            "Description": "Loves the heat. They'll complain less than others when it's hot, but will whine more when it's cold",
            "Stats": "Max comfortable temp +5C [+9F], Min comfortable temp +3C [+5.4F]",
            "Conflicts": "Cold Lover"
        },
        {
            "Trait": "Heavy Sleeper",
            "Description": "They sleep like a rock, never bothered by adverse sleeping conditions, but is difficult to wake up",
            "Conflicts": "insomniac, neurotic, very neurotic"
        },
        {
            "Trait": "Herculean",
            "Description": "Born with impossible strength and force of will",
            "Stats": "Melee +6, Mental break threshold -100%, Carrying capacity +150, Armor - Blunt +50%, Armor - Sharp +70%"
        },
        {
            "Trait": "Hunter",
            "Description": "They are a hunter; they employ field-craft, cunning, and skill with a bow to defend their land from invaders",
            "Stats": "Move speed +0.2, Immunity gain speed +25%, Max comfortable temp +27F [15C], Min comfortable temp -27F [-15C], Aiming time -20%, Toxic sensitivity -15%, Butchery speed +10%, Smelting speed -15%, Construction speed -15%, Tame animal +12%, Train animal +12%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Ice Mage",
            "Description": "They are attuned with the elements of water",
            "Stats": "Mental break threshold -10%, Research speed +20%, Global learning factor +10%, Global work speed -10%, Social impact -20%, Max comfortable temp -12.6F [-7C], Min comfortable temp -27F [-15C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Imhotep's Wisdom",
            "Description": "They send to sleep those who suffer, the new day bringing good health to them",
            "Stats": "Medical +8, Medical tend speed +100%, Medical operation speed +100%, Medical surgery success +100%, Medical tend quality +100%, Armor - Blunt +100%, Armor - Sharp +120%"
        },
        {
            "Trait": "Imperial-Assassinorum",
            "Description": "Has been trained by the Officio Assassinorum to be a surgical tool to serve the Emperor against Chaos. They are blessed for combat excellence at range",
            "Stats": "Shooting +3, Melee +3, Aiming time -20%, Shooting accuracy +0.2, Global learning factor +30%, Move speed +0.1, Mental break threshold -15%, Immunity gain speed +15%, Carrying capacity +75, Armor-blunt +15%, Armor-sharp +15%, Toxic sensitivity -15%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Imperial-Astarte",
            "Description": "They have been blessed by the Emperor by the pinnacle of Human Warfare as one of his Chosen Astarte in the fight against Chaos. They are blessed with the Astarte trait",
            "Stats": "Shooting +5, Melee +5, Melee dodge +0.1, Aiming time -20%, Shooting accuracy +0.2, Move speed +0.15, Mental break threshold -20%, Immunity gain speed +25%, Carrying capacity +200, Armor-blunt +20%, Armor-sharp +20%, Toxic sensitivity -20%, Max high points x70%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Imperial-AstraMilitarum",
            "Description": "Has been blessed by the Emperor to be overall better than regular humans at all tasked related to combat to better serve the Emperor against Chaos. They are blessed with general combat excellence",
            "Stats": "Shooting +3, Melee +3, Melee dodge +0.3, Aiming time -15%, Shooting accuracy +0.2, Global learning factor +15%, Move speed +0.1, Mental break threshold -15%, Immunity gain speed +15%, Carrying capacity +100, Armor-blunt +10%, Armor-sharp +10%, Toxic sensitivity -10%, Melee hit chance x300%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Imperial-Inquisition",
            "Description": "Has been trained by the Inquisition as the secret police of the Imperium responsible for guarding the souls of humanity. They are blessed by the Inquisition with a many varied skills",
            "Stats": "Shooting +2, Melee +1, Crafting +1, Medical +2, Global work speed +10%, Aiming time -10%, Shooting accuracy +0.2, Global learning factor +14%, Move speed +0.3, Mental break threshold -15%, Immunity gain speed +14%, Carrying capacity +75, Armor-blunt +14%, Armor-sharp +14%, Tosix Sensitivity -14%, Social impact +13%, Research speed +14%, Psychic sensitivity -20%, Melee hit chance x250%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Imperial-Mechanicus",
            "Description": "Has been blessed by the Mechanicus to be overall better than regular humans at all tasked related to research, craft and mining. They are blessed for a harsh working environment",
            "Stats": "Crafting +3, Construction +3, Mining +3, Global work speed +25%, Global learning factor +130%, Move speed +0.1, Immunity gain speed +20%, Carrying capacity +150, Trade price improvement +25%, Social impact +10%, Psychic sensitivity +10%, Construction speed +10%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Imperial-Medic",
            "Description": "Has been training in the arts of all medicine to help their fellow imperial citizens. They are blessed with medical excellence",
            "Stats": "Medical +6, Global learning factor +15%, Move speed +0.1, Mental break threshold +13%, Immunity gain speed +13%, Carrying capacity +150, Toxic sensitivity -12%, Social impact +15%",
            "Conflicts": "All other Imperial traits"
        },
        {
            "Trait": "Industrious",
            "Description": "They have an easy time staying on-task and focused, and get things done much faster than the average person",
            "Stats": "Global work speed +35%",
            "Conflicts": "coordinated, hard worker, inept, lazy, perfectionist, slothful"
        },
        {
            "Trait": "Inept",
            "Description": "They mean well, but they aren't coordinated and just not very good at any sort of skilled labor",
            "Stats": "Artistic -2, Construction -2, Cooking -2, Crafting -2, Mining -2, Global work speed -25%, Animal gather speed -20%, Animal gather yield -20%, Butchery efficiency -20%, Butchery speed -20%, Mechanoid disassembly efficiency -20%, Mechanoid disassembly speed -20%, Construction speed -20%, Construct success chance -20%, Cooking speed -0.2, Repair success chance -20%, Food poison chance +20%, Mining speed -20%, Mining yield -20%, Plant harvest yield -20%, Plant work speed -20%, General labor speed -20%",
            "Conflicts": "industrious, hardworker, lazy, slothful, builder, butcher, claustrophobic, gourmet, inventor, perfectionist, rockhound, savant"
        },
        {
            "Trait": "Innocence",
            "Description": "Their heart has innocence. Maybe it's because they've never experienced a tough world before. They will be more traumatized by violent acts such as cannibalism, organ harvesting and sight of dead bodies",
            "Conflicts": "psychopath, bloodlust, cannibal"
        },
        {
            "Trait": "Insomniac",
            "Description": "Finds it difficult to sleep because of this condition. They will prioritize sleep less, wake up sooner, and get less rest from sleeping",
            "Conflicts": "heavy sleeper"
        },
        {
            "Trait": "Intolerance",
            "Description": "Is intolerant of all lifeforms, whether they be mechanical or biological. There is always a chance they will randomly cause fights, especially if their mood is low",
            "Stats": "permanent mood effect -15, social impact -90%"
        },
        {
            "Trait": "Inventor",
            "Description": "Strange new ideas just appear in their mind. Researching new technologies comes easily to them, but they always seem distracted",
            "Stats": "Intellectual +2, Research speed +40%, Global work speed -20%, Move speed -0.1, Psychic sensitivity +10%, Mental break threshold +10%",
            "Conflicts": "Coordinated, Dunce, Inept"
        },
        {
            "Trait": "Ironman",
            "Description": "High tolerance for pain",
            "Stats": "pain shock threshold +15%, incoming damage multiplier -15%",
            "Conflicts": "tough, wimp"
        },
        {
            "Trait": "Iron-willed",
            "Description": "Their will is an iron shield. They keep going through thick and thin, when others broke down long before",
            "Stats": "Mental break threshold -18%",
            "Conflicts": "Too smart"
        },
        {
            "Trait": "Jealous",
            "Description": "For them, it's degrading to have a less impressive bedroom than someone else. They get a mood loss if any colonist has a more impressive bedroom",
            "Conflicts": "Ascetic, Greedy"
        },
        {
            "Trait": "Jogger",
            "Description": "They always move with a sense of urgency - so much so that others often fail to keep up",
            "Stats": "move speed +0.7, rest rate multiplier -10%"
        },
        {
            "Trait": "Keeneye",
            "Description": "Has a keen eye and can spot even tiny mineral deposits. They will occasionally find small clumps of resources when mining any sort of stone or ore. Chance increased on flatter terrain",
            "Stats": "mining speed +40%"
        },
        {
            "Trait": "Keeper",
            "Description": "Is a Keeper, a mage that specializes in base defense",
            "Stats": "move speed -0.15, min comfortable temp -21.6F[-12C], max comfortable temp +21.6F[12C], plant work speed +20%, plant harvest yield +20%, carry capacity +20, mental break threshold -8%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Kind",
            "Description": "They are a nice person. They have a tendency to brighten everyone else's day and never insults others",
            "Conflicts": "Abrasive, Psychopath"
        },
        {
            "Trait": "Lazy",
            "Description": "They're a little bit lazy",
            "Stats": "Global work speed -20%",
            "Conflicts": "Coordinated, Hard Worker, Industrious, Inept, Perfectionist, Slothful"
        },
        {
            "Trait": "Lecher",
            "Description": "Is unabashedly lecherous and a thoughtless heartbreaker. They will hit on anyone they desire with no regard for the consequences",
            "Conflicts": "Codependent, Open-minded, Prude"
        },
        {
            "Trait": "Legendary Bladedancer",
            "Description": "Has become a legend, their skill in melee combat is known across the world. Their skill in combat makes it look as if each movement, each strike, is merely a stitch in a tapestry that depicts their victory",
            "Stats": "Move speed +0.4, Mental break threshold -10%, Melee hit +15, Melee dodge +20, Pain shock threshold +10%, Shooting accuracy -30, Global work speed -5%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Legendary Sniper",
            "Description": "They are a legendary sniper, skilled in the economy and accuracy of long range, small arms combat. Other colonists avoid eye contact and whisper in corners about how dangerous she is and that suits them just fine",
            "Stats": "Move speed +0.25, Aiming time -30%, Shooting accuracy +8, Research speed -16%, Global work speed -16%, Tame animal -16%, Train animal -16%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Lich",
            "Description": "They have transformed into a lich, forsaking live in exchange for power and an immortal existence, choosing to employee undead for menial tasks",
            "Stats": "Intellectual +2, Move speed -2.00, Min comfortable temp -72F [-40C], Immunity gain speed +100%, Toxic Sensitivity -100%, Mental break threshold -20%, Global learning factor -40%, Trade price improvement -50%, Negotiation ability -50%, Global work speed -75%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Lightning Mage",
            "Description": "They are attuned with the elements of lightning",
            "Stats": "Move speed +0.2, Global work speed +10%, Melee dodge +2.0, Mining speed -40%, Mining yield -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Loved by Animals",
            "Description": "They are loved by animals, but people don't quite feel the same",
            "Stats": "Animals +1, Train animal +50%, Tame animal +50%, Social impact -50%"
        },
        {
            "Trait": "Loves Humanity",
            "Description": "Has a deep fondness toward all humans, seeing them as not only their own creators but as parental figures",
            "Conflicts": "Hates Humanity"
        },
        {
            "Trait": "Low Pain Tolerance",
            "Description": "Will become immobilized by pain more quickly than most",
            "Stats": "Pain shock threshold -33%",
            "Conflicts": "Ironman, Tough, Unstoppable, Wimp"
        },
        {
            "Trait": "Magically Gifted",
            "Description": "Has a magical gift. They can harness this gift to become a mage by studying the mysterious secrets within an arcane script",
            "Stats": "Move speed +0.1, Medical tend speed +10%, Immunity gain speed +10%, Psychic sensitivity +20%, Global learning factor +10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Mana Well",
            "Description": "Has an increased resistance to the ebb and flow of mana which allows them to hold an additional 40 mana, but reduces their mana regeneration by 20%",
            "Conflicts": "Arcane Conduit, Boundless"
        },
        {
            "Trait": "Masochist",
            "Description": "There's something exciting about getting hurt. They don't know why, they're just wired differently"
        },
        {
            "Trait": "Master Diplomat",
            "Description": "Has such a way with words that they always manager to cool down a tense situation. They could talk for days and people would still listen",
            "Stats": "Social +4, Negotiation ability +30%, Social impact +40%",
            "Conflicts": "Abrasive, Annoying Voice, Creepy Breathing, Diplomat, Uncouth"
        },
        {
            "Trait": "Master Medic",
            "Description": "Has a natural aptitude for medical work. Between their steady, skilled hands and their inspiring bedside manner, patients in their care have little to fear",
            "Stats": "Medical +4, Medical operation speed -20%, Medical surgery success +40%, Medical tend speed -20%, Medical tend quality +40%",
            "Conflicts": "Poor Medic, Skilled Medic"
        },
        {
            "Trait": "Master Sniper",
            "Description": "They are a master sniper, skilled in the economy and accuracy of long rage, small arms combat. Being a sniper has made them avoid other colonists, not that they care",
            "Stats": "Move speed +0.2, Aimint time -22%, Shooting accuracy +6, Research speed -15%, Global work speed -15%, Tame animal -15%, Train animal -15%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Master Trader",
            "Description": "Always gets the best deals",
            "Stats": "Social +4, Trade price improvement +40%",
            "Conflicts": "Abrasive, Annoying Voice, Creepy Breathing, Haggler, Sucker"
        },
        {
            "Trait": "Mech",
            "Description": "A mechanized ingantry unit, they do not think or feel",
            "Stats": "permanent mood effect +100, social impact -90%"
        },
        {
            "Trait": "Mechanoid Expert",
            "Description": "Has had their fair share of encounters with mechanoids. They have become an expert in mechanoid construction and combat, making them uniquely suited to disassemble and fight them",
            "Stats": "damage vs. mechanoids +50%, mechanoid shredding efficiency +50%"
        },
        {
            "Trait": "Medic",
            "Description": "A dedicated doctor with an array of powerful utility abilities that they can support their allies with. They are very poor direct combatants, however",
            "Stats": "medical +6, move speed +2, aiming time +50%, melee hit chance -20, melee dodge chance -20, shooting accuracy -30, medical tend quality +100%, medical tend speed +100%, medical operation speed +100%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Melodic Voice",
            "Description": "They could talk for days on end and people would still listen to that sweet voice",
            "Stats": "Social impact +40%",
            "Conflicts": "Awkward, Tucker"
        },
        {
            "Trait": "Mercury's Blessing",
            "Description": "It is said that they can leap the space between lightning and thunder, outfox the fox king, and reach tomorrow before the sun",
            "Stats": "Intellectual +8, Eating speed +100%, Global work speed +100%, Global learning factor +100%, Move speed +1, Armor - Blunt +100%, Armor - Sharp +120%"
        },
        {
            "Trait": "Minstrel",
            "Description": "Everyone loves being around them. They have talent, wit and skill in many forms of entertainment and is able to make a personal connection with almost everyone",
            "Stats": "Social impact +30%, Negotiation ability +35%, Trade price improvement +20%, Pain shock threshold +20%, Carrying capacity -18, Global work speed -14%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Misandrist",
            "Description": "Really dislikes and distrusts men"
        },
        {
            "Trait": "Misogynist",
            "Description": "Really dislikes and distrusts women"
        },
        {
            "Trait": "Monk",
            "Description": "They are a monk, dedicated to mastering Chi - the energy that connects all life in the universe. They harness Chi to create magical effects and exceed her physical capabilities. They are also able to disrupt the Chi in others, affecting their command over spells and abilities",
            "Stats": "Melee dodge +5, Melee hit +5, Carrying capacity +20, Pain shock threshold +10%, Social impact -25%, Negotiation ability -25%, Psychic sensitivity -80%, Trade price improvement -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Morbid",
            "Description": "Ashes to ashes and dust to dust, they are fascinated by corpses and decay"
        },
        {
            "Trait": "Mysterious Energy",
            "Description": "Gives a strange impression to their opponent",
            "Stats": "social +2, mental break threshold -4%, train animal chance +15%, tame animal chance +15%, trade price improvement +15%, social impact +15%"
        },
        {
            "Trait": "Natural born colony-child",
            "Description": "Has been born in the colony",
            "Stats": "enables Natural meditation focus type"
        },
        {
            "Trait": "Natural Butcher",
            "Description": "Sometimes it's hard to tell where the knife stops and they start. People like to say that 'if it bleeds, they can skin it and split it.'",
            "Stats": "Cooking +1, Mechanoid disassembly speed -20%, Butchery speed +50%"
        },
        {
            "Trait": "Near-sighted",
            "Description": "They have a hard time seeing things clearing unless they are relatively close to it",
            "Stats": "Global work speed -10%, Shooting accuracy -0.3"
        },
        {
            "Trait": "Neat Freak",
            "Description": "Is fastidious to a fault",
            "Stats": "Cooking +2, Global work speed -20%, Food poison chance -50%, Immunity gain speed +20%, Medical surgery success chance +20%, Medical tend quality +20%, Medical operation speed -10%, Medical tend speed -10%"
        },
        {
            "Trait": "Necromancer",
            "Description": "They are attuned with the forces of death",
            "Stats": "Move speed -0.3, Min comfortable temp -36F [-20C], Immunity gain speed +40%, Toxic sensitivity -40%, Mental break threshold -10%, Global learning factor +40%, Trade price improvement -50%, Negotiation ability -25%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Nervous",
            "Description": "Tends to crack under pressure",
            "Stats": "Mental break threshold +8%",
            "Conflicts": "Iron-willed, Steadfast, Too Smart, Volatile"
        },
        {
            "Trait": "Neurotic",
            "Description": "They like to have things squared away. They will work harder than most to attain this state of affairs, but their nerves can get the better of them",
            "Stats": "Global work speed +20%, Mental break threshold +8%",
            "Conflicts": "Very Neurotic"
        },
        {
            "Trait": "New Type",
            "Description": "Awakened with a new type. They are amazing at dodging, and get +5 points for melee and shooting",
            "Stats": "melee +5, shooting +5, melee dodge chance +25, trap spring chance x20%",
            "Conflicts": "Deftly Dodger, Nimble, Sluggish"
        },
        {
            "Trait": "Nibbler",
            "Description": "Picks at their food, taking extra time to finish meals",
            "Stats": "Eating speed -25%",
            "Conflicts": "Glutton"
        },
        {
            "Trait": "Night Owl",
            "Description": "Likes to be up during the night, and sleep during the day. They get a mood bonus if awak at night (23h-6h) and a mood loss if awake during the day (11h-18h). They don't get a mood penalty for being in the dark"
        },
        {
            "Trait": "Nimble",
            "Description": "They have remarkable kinesthetic intelligence. They seem to dance around danger with pretenatural grace",
            "Stats": "Melee dodge +15",
            "Conflicts": "Deftly Dodger, Sluggish"
        },
        {
            "Trait": "Ninja",
            "Description": "A stealthy and agile fighter with a few magical tricks up their sleeves. They excel in bringing down enemies before they even know what hit them",
            "Stats": "move speed +0.15, mental break threshold -8%, melee hit chance +15, melee dodge chance +15, pain shock threshold +5%, global work speed +6%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Nudist",
            "Description": "Enjoys the feeling of freedom that comes from being nude. They can handle clothing, but will be happier without it"
        },
        {
            "Trait": "Nyctophile",
            "Description": "Doesn't fear the dark at all",
            "Conflicts": "Nyctophobe"
        },
        {
            "Trait": "Nyctophobe",
            "Description": "Really afraid of the dark",
            "Conflicts": "Nyctophile"
        },
        {
            "Trait": "Odyssean",
            "Description": "Craftier by far than any mortal man, they are also a very capable warrior",
            "Stats": "Melee +1, Shooting +1, Global learning factor +0.5, Melee hit chance +0.5"
        },
        {
            "Trait": "Open-minded",
            "Description": "Sees people for what they are on the inside, not the outside. They don't judge others for their appearances",
            "Conflicts": "Body purist, lecher, misandrist, misogynist, prude, psychopath"
        },
        {
            "Trait": "Optimist",
            "Description": "Naturally optimistic about life, it's hard to get them down",
            "Stats": "Permanent mood effect +6",
            "Conflicts": "Depressive, Pessimist, Sanguine"
        },
        {
            "Trait": "Outdoorsy",
            "Description": "Loves to be outside. They get a mood bonus when there is no roof over their head",
            "Conflicts": "Undergrounder"
        },
        {
            "Trait": "Overweight",
            "Description": "They are seriously overweight. They move slowly and work even slower",
            "Stats": "Move speed -0.3, Global work speed -25%, Meat amount +10",
            "Conflicts": "Athletic"
        },
        {
            "Trait": "Paladin",
            "Description": "Has been bestowed with divine might and has sworn to uphold justice whever they stand",
            "Stats": "Move speed +0.1, Immunity gain speed +20%, Mental break threshold -2%, Pain shock threshold +10%, Psychich sensitivity -20%, Global learning factor -15%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Perceptive",
            "Description": "They have a keen eye, and can quickly spot a target",
            "Stats": "Shooting +1, Shooting accuracy +0.3, Melee hit chance +0.1"
        },
        {
            "Trait": "Perfectionist",
            "Description": "Refuses to accept less than their best in any endeavor, no matter how long it takes. They're less like to fail when doing something, but they work slower",
            "Stats": "Global work speed -20%, Animal gather speed -10%, Animal gather yield +20%, Butchery efficiency +20%, Butchery speed -10%, Mechanoid disassembly efficiency +20%, Mechanoid disassembly speed -10%, Construction speed -10%, Construct success chance +20%, Cooking speed -0.1, Repair success chance +20%, Food poison chance -20%, Medical operation speed -10%, Medical surgery success +20%, Medical tend quality +20%, Medical tend speed -10%, Mining speed -10%, Mining yield +20%, Plant harvest yield +20%, Plant work speed -10%, Research speed -10%, General labor speed -10%",
            "Conflicts": "Coordinated, Harder Worker, Industrious, Inept, Lazy, Slothful"
        },
        {
            "Trait": "Performer",
            "Description": "Is a performer; expanding on natural talent, they have begun to take a conscious role to improve the mood of other colonists",
            "Stats": "Social impact +20%, Negotiation ability +30%, Trade price improvement +15%, Pain shock threshold -12%, Carrying capacity -15, Global work speed -12%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Persuasive",
            "Description": "They are good at persuading someone to do or believe something through reasoning or the use of temptation",
            "Stats": "Negotiation ability +10%, Social impact +10%, Trade price improvement +5%",
            "Conflicts": "Amateur Haggler, Haggling Enthusiast, Sucker"
        },
        {
            "Trait": "Pervert",
            "Description": "They are an exterme perfert. They don't mind sharing a room, or streaking. It makes others feel incredibly uncomfortable",
            "Stats": "Social -1"
        },
        {
            "Trait": "Pessimist",
            "Description": "Tends to look on the bad side of life",
            "Stats": "Permanent mood effect -6",
            "Conflicts": "Depressive, Optimist, Sanguine"
        },
        {
            "Trait": "Photosensitive",
            "Description": "Has eyes, either through gene modding or random mutation, that are extremely light-sensitive. They find bright light extremely painful and indoor lighting bothersome and will be happiest in the dark",
            "Conflicts": "Faithful"
        },
        {
            "Trait": "Physically Adept",
            "Description": "Physically adept and has potential to learn special combat forms",
            "Stats": "Move speed +0.2, Global work speed +20%, Immunity gain speed +20%, Psychic sensitivity -20%, Global learning factor -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Plaguedoctor",
            "Description": "A half-crazed medieval physician who delights in poisons and diseas. They are capable of performing uniquely terrifying surgical procedures on both allies and enemies",
            "Stats": "move speed +0.5, melee hit chance +10, medical tend quality -50%, medical tend speed +500%, medical operation speed +500%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Pluviophile",
            "Description": "Likes the rain. They get a mood bonus when it's pouring outside, especially if they get to go out in it."
        },
        {
            "Trait": "Polyamorous",
            "Description": "Doesn't see any problem with having multiple partners, they don't mind if their partner romances other people, but will be less happy in a restraining, monogamous relationship",
            "Conflicts": "Codependent, prude"
        },
        {
            "Trait": "Poor Medic",
            "Description": "Even when they have the best of intentions, some people just aren't cut out for medicine",
            "Stats": "Medical -2, Medical surgery success -20%, Medical tend quality -20%",
            "Conflicts": "Master Medic, Skilled Medic"
        },
        {
            "Trait": "Pretty",
            "Description": "Has a pretty face, which predisposes people to like them",
            "Conflicts": "Beautiful, Staggeringly Ugly, Ugly"
        },
        {
            "Trait": "Pridestalker",
            "Description": "A fighter that combines bow and magic to turn any fight into a deadly hunt",
            "Stats": "move speed +1, immunity gain speed +20%, max comfortable temp +28.8F [16C], min comfortable temp -28.8F [-16C] aiming time -25%, toxic sensitivity +20%, butchery speed +50%, tame animal chance +30%, train animal chance +30%, global work speed -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Priest",
            "Description": "Is attuned with the forced of life and healing and has taken a vow against harming others",
            "Stats": "Medical +2, Move speed +0.15, Immunity gain speed +20%, Medical surgery success +25%, Medical tend quality +25%, Medical operation speed +25%, Medical tend speed +25%, Pain shock threshold -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Prude",
            "Description": "Hates the sight of the human body. They will be extremely unhappy when naked, more displeased than usual in tattered or worn-out clothing, and dislike the sight of other naked people",
            "Conflicts": "Lecher, nudist, open-minded, polyamorous"
        },
        {
            "Trait": "Psionic",
            "Description": "Is a Psionic - able to manifest thought into raw energy. They are able to project psionic energy but finds it easier and more efficient to apply it as an extension and augmentation of her body. For this reason, they prefer to be free of encumbering weapons. They have become less social since developing psionic powers since they can perform any task on their own and can do without the jealousy of others",
            "Stats": "Social impact -25%, Negotiation ability -20%, Trade price improvement -10%, Carrying capacity +20, Melee dodge +10, Melee hit +10, Pain shock threshold +20%, Psychic sensitivity +20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Psychically Deaf",
            "Description": "Their mind works on a psychic frequency different from everyone else. They just aren't affected by psychic phenomena",
            "Stats": "Psychic sensitivity -100%",
            "Conflicts": "Psychically Dull, Psychically Hypersensitive, Psychically Sensitive"
        },
        {
            "Trait": "Psychically Dull",
            "Description": "Their mind is psychically out of tune with others. They aren't as affected by psychic phenomena",
            "Stats": "Psychic sensitivity -50%",
            "Conflicts": "Psychically Deaf, Psychically Hypersensitive, Psychically Sensitive"
        },
        {
            "Trait": "Psychically Hypersensitive",
            "Description": "Their mind is like a psychic tuning fork. They are extremely sensitive to psychic phenomena",
            "Stats": "Psychical sensitivity +80%",
            "Conflicts": "Psychically Deaf, Psychically Dull, Psychically Sensitive"
        },
        {
            "Trait": "Psychically Sensitive",
            "Description": "Their mind is unusually sensitive to psychic phenomena",
            "Stats": "Psychical sensitivity +40%",
            "Conflicts": "Psychically Deaf, Psychically Dull, Psychically Hypersensitive"
        },
        {
            "Trait": "Psychopath",
            "Description": "Has no empathy. The suffering of others doesn't bother them at all. They don't mind if others are butchered, left unburied, imprisoned, or sold to slavery - unless it affects them. They also feel no mood boost from socializing"
        },
        {
            "Trait": "Pyromaniac",
            "Description": "They love fire. They will never extinguish fires. To relieve stress, they will occasionally go on random fire starting sprees. This happens more often if their mood is low"
        },
        {
            "Trait": "Quick Learner",
            "Description": "They have always picked up skills pretty quickly",
            "Stats": "Global learning factor +25%"
        },
        {
            "Trait": "Quick Sleeper",
            "Description": "They don't need as much sleep as the average person. Whether they're sleeping on a bed or on the ground, they will be fully rested in about two thirds the usual time",
            "Stats": "Rest rate multiplier +50%"
        },
        {
            "Trait": "Railbreaker",
            "Description": "A reckless melee brawler equiped with extremely dangerous augments that allow them to create explosions at will, which they fire at point-blank rance. They are unmatched in firepower, but their greatest weakness is the recoil from their own moves",
            "Stats": "move speed -0.5, social impact +50%, shooting accuracy -10, pain shock threshold +50%, mental break threshold -12%, incoming damage multiplier x50%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Ranger",
            "Description": "They are a ranger; master of the wilds. They are a master of their craft and defender of their land",
            "Stats": "Move speed +0.3, Immunity gain speed +35%, Max comfortable temp +36F [20C], Min comfortable temp -36F [-20C], Aiming time -40%, Toxic sensitivity -25%, Butchery speed +25%, Smelting speed -20%, Construction speed -20%, Tame animal +15%, Train animal +15%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Reaper",
            "Description": "No one knows of their true origins, but in battle they seem more a demon than anything else. They are capable of flying directly into enemy positions unbidden, where they are capable of warping the minds of enemies, causing discord and destruction among former allies",
            "Stats": "move speed +0.8, mental break threshold -16%, melee hit chance +10, melee dodge chance +10, pain shock threshold +20%, aiming time -40%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Red Mage",
            "Description": "A flourishing spellblade who weaves through combat with deadly flair",
            "Stats": "move speed +0.4, melee hit chance +10, pain shock threshold -15%, negotiation ability +20%, trade price improvement +20%, social impact +100%, global learning factor +20%, global work speed -20%, mental break threshold +8%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Robot",
            "Description": "They are a robot. As a robot they are a bit faster and not really sensible for psychic phenomena",
            "Stats": "Move speed +0.1, Global work speed +20%, Psychic sensitivity -100%, Toxic sensitivity -95%, Mental break threshold -90%"
        },
        {
            "Trait": "Rockhound",
            "Description": "Enjoys working with rocks. Their mining speed is increased, but their lack of interest in other areas slows them down when doing other jobs. And they hate working with plants",
            "Stats": "Crafting +2, Mining +4, Global work speed -20%, Mining speed +40%, Mining yield +20%, Plant harvest yield -50%, plant work speed -40%, Smoothing speed +40%",
            "Conflicts": "Claustrophobic, Coordinated, Inept"
        },
        {
            "Trait": "Saboteur",
            "Description": "A fighter that specializes in going behind enemy lines and disabling key enemy buildings and defenses",
            "Stats": "mental break threshold -12%, pain shock threshold -10%, move speed +0.5, social impact +50%, global work speed +10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Samurai",
            "Description": "A wandering swordsman who specializes in lai",
            "Stats": "research speed -20%, global work speed -20%, shooting accuracy -10, pain shock threshold +15%, melee hit chance +10",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Sanguine",
            "Description": "They are just naturally upbeat about their situation, pretty much all the time, no matter what it is",
            "Stats": "Permanent mood effect +12",
            "Conflicts": "Depressive, Optimist, Pessimist"
        },
        {
            "Trait": "Savant",
            "Description": "Is a modern-day Da Vinci, with a creative mind that can grasp new ideas almost effortlessly. But they're almost painfully slow when it comes to doing actual physical work\t",
            "Stats": "Artistic +4, Crafting +4, Intellectual +4, Global learning factor +80%, Global work speed -60%",
            "Conflicts": "Coordinated, Dunce, Fast Learner, Inept, Too Smart"
        },
        {
            "Trait": "Scion",
            "Description": "A melee fighter that channels the aspects of ancient spirits to aid them both in combat and in daily life",
            "Stats": "move speed +0.5, melee dodge chance +5, melee hit chance +5, shooting accuracy -10, psychic sensitivity +50%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Scout",
            "Description": "Comfortable in the wilds, and relied upon to be the eyes and ears of a colony. They employ expertise in field-craft, cunning, and the bow to defend their land from invaders",
            "Stats": "move speed +0.25, immunity gain speed +30%, max comfortable temp +32.4F [18C], min comfortable temp -32.4F [-18C], aiming time -30%, tosic sensitivity -20%, butchery speed +15%, smelting speed -18%, construction speed -18%, tame animal chance +14%, train animal chance +14%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Scrapper",
            "Description": "A combatant that prefers unarmed brawling. They are unmatched in single combat with their huge array of single-target takedown moves",
            "Stats": "move speed +0.3, aiming time +100%, shooting accuracy -20, melee hit chance +15, melee dodge chance +15, mental break threshold -18%, carrying capacity +40, pain shock threshold +100%, incoming damage multiplier x50%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Sedentary",
            "Description": "Is a very active person. They aren't very physically fit, but they enjoy sitting around all day working on things",
            "Stats": "move speed -0.15",
            "Conflicts": "Fast walker, jogger, slowpoke"
        },
        {
            "Trait": "Shadow",
            "Description": "Is a half-breed demon with an affinity for shadow magib. They have developed their unique talents through combay training and physical conditioning making them the perfect assassin",
            "Stats": "psychic sensitivity +25%, pain shock threshold +20%, move speed +0.25, melee hit chance +10, melee dodge chance +10, shooting accuracy -5, global work speed -10%, toxic sensitivity -20%, research speed -20%, social impact -20%, negotiation bility -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Shaman",
            "Description": "Shamans take a more harmonious approach to arcane powers than most mages, choosing to pursue a path that works with the ebb and flow of magic to offest or enhance the natural order. They are kin to the spirit realm and more attuned to nature and its elements",
            "Stats": "psychic sensitivity +20%, toxic sensitivity +30%, immunity gain speed +10%, tame animal chance +30%, train animal chance +30%, global learning factor -10%, global work speed -10%, smelting speed -25%, construction speed -25%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Sharpshooter",
            "Description": "They have trained to become a sniper, skilled in the economy and accuracy of long range, small arms combat. Training to become a sniper has caused some colonists to be uncomfortable around them, not that they care",
            "Stats": "Move speed +0.1, Aiming time -10%, Shooting accuracy +2, Research speed -10%, Global work speed -10%, Tame animal -10%, Train animal -10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Shoot to kill",
            "Description": "came from an especially dangerous world and is conditioned to kill before they're killed. Their accuracy is increased",
            "Stats": "shooting +4, shooting accuracy +3",
            "Conflicts": "Brawler"
        },
        {
            "Trait": "Shooting Amateur",
            "Description": "They have never held a gun in their hands. The weight of the cold metal in their hands makes them shudder uncontrollably",
            "Stats": "Shooting -2, Shooting accuracy -0.2",
            "Conflicts": "Brawler, Shooting enthusiast, Shooting Professional"
        },
        {
            "Trait": "Shooting Enthusiast",
            "Description": "Knows their way with a gun",
            "Stats": "Shooting +2, Shooting accuracy +0.2",
            "Conflicts": "Brawler, Shooting Amateur, Shooting Professional"
        },
        {
            "Trait": "Shooting Professional",
            "Description": "My rifle is my best friend. It is my life. I must master it as I must master my life.'",
            "Stats": "Shooting +4, Shooting accuracy +0.4",
            "Conflicts": "Brawler, Shooting Amateur, Shooting Enthusiast"
        },
        {
            "Trait": "Sickly",
            "Description": "Has an awful immune system. They get sick more often than usual, frequently with illnesses that nobody in the colony has been afflicted by",
            "Stats": "Medical +4",
            "Conflicts": "Super-immune"
        },
        {
            "Trait": "Silver tongue",
            "Description": "knows exactly the right words for every situation. This also means their insults hurt more",
            "Stats": "trade price improvement +33%, negotiation ability +20%, social impact +50%"
        },
        {
            "Trait": "Simple minded",
            "Description": "Due to the limitations of this androids mind they are only barely able to understand and feel emotion. This makes them less than desired in social situations",
            "Stats": "permanent mood effect +20, social impact -90%"
        },
        {
            "Trait": "Skilled Medic",
            "Description": "Seems to have a knack for medical work. Patients in their care will likely fare well",
            "Stats": "Medical +2, Medical surgery success +20%, Medical tend quality +20%",
            "Conflicts": "Master Medic, Poor Medic"
        },
        {
            "Trait": "Slothful",
            "Description": "Loves idleness and hates anything productive. They move slowly and rarely stays focused on a task",
            "Stats": "Global work speed -35%",
            "Conflicts": "Coordinated, Hard Worker, Industrious, Inept, Lazy, Perfectionist"
        },
        {
            "Trait": "Slow Learner",
            "Description": "Slow on the update. They learn much slower than others",
            "Stats": "Global learning factor -75%",
            "Conflicts": "Too Smart"
        },
        {
            "Trait": "Slowpoke",
            "Description": "They're always falling behind the group whenever they go anywhere",
            "Stats": "Move speed -0.2",
            "Conflicts": "Fast Walker, Jogger"
        },
        {
            "Trait": "Sluggish",
            "Description": "Not very good at getting out of the way of blows",
            "Stats": "Melee dodge chance -10",
            "Conflicts": "Deftly Dodger, Nimble"
        },
        {
            "Trait": "Sniper",
            "Description": "They have trained to become a sniper, skilled in the economy and accuracy of long range, small arms combat. Becoming a sniper has caused them to become distanced from other colonists and somewhat unapproachable, not that they care",
            "Stats": "Move speed +0.15, Aimint time -15%, Shooting accuracy +4, Research speed -13%, Global work speed -13%, Tame animal -13%, Train animal -13%",
            "Conflicts": "Bad Shot, Brawler"
        },
        {
            "Trait": "Socialite",
            "Description": "Is very good at communicating with other people",
            "Stats": "Social +5, Social impact +20%"
        },
        {
            "Trait": "Staggeringly Ugly",
            "Description": "They are staggeringly ugly. Their face looks like a cross between a drawing by an untalented child, a malformed fetus in a jar of formaldehyde, and a piece of modern art. Others must exert conscious effort to look at them while conversing",
            "Stats": "Beauty -2",
            "Conflicts": "Beautiful, Pretty, Ugly"
        },
        {
            "Trait": "Starseeker",
            "Description": "A fledgling mage with incredible potential",
            "Stats": "animals -6, artistic -6, construction -6, cooking -6, crafting -6, medical -6, melee -6, mining -6, intellectual -6, plants -6, shooting -6, social -6, move speed +1, global learning factor +100%, research speed +60%, eating speed x200%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Steadfast",
            "Description": "They are mentally tough and won't break down under stresses that would crack most people",
            "Stats": "Mental break threshold -9%",
            "Conflicts": "Iron-willed, Nervous, Too Smart, Volatile"
        },
        {
            "Trait": "Steady hands",
            "Description": "Has particularly steady hands, which don't even tremble in dire circumstances or when they're injured",
            "Stats": "no self-tend penalty, medical tend speed +50%, medical tend quality +10%, shooting accuracy +3"
        },
        {
            "Trait": "Stealthy",
            "Description": "Is uncommonly agile and stealthy, with better reflexes and a more flexible body than most",
            "Stats": "hunting stealth +100%, move speed +0.3, melee dodge chance +10",
            "Conflicts": "fast walker, jogger, slowpoke"
        },
        {
            "Trait": "Strong back",
            "Description": "Has a very strong back or is part mule or something. They can carry significantly more than a normal person",
            "Stats": "carrying capacity +75",
            "Conflicts": "wimp"
        },
        {
            "Trait": "Strong Constitution",
            "Description": "Body is stronger than normal against diseases, pathogens and toxic fallout",
            "Stats": "Immunity gain speed +25%, Toxic sensitivity -50%",
            "Conflicts": "Weak Constitution"
        },
        {
            "Trait": "Succubus",
            "Description": "Has a strange genetic strain that grants her enhanced physical attributes. They are also extremely attractive with an exotic facial structure that captures the eye. A succubus is more likely to exploit her physical advantages and have others do their work for them. Their succubus charm has its disadvantaces and can cause someone to become jealous and even despise them.",
            "Stats": "Move speed +0.2, Global work speed -20%, Immunity gain speed +15%, Trade price improvement +10%, Negotiation ability +20%, Carrying capacity -20, Global learning factor -20%, Melee dodge +5, Research speed -20%, Aiming time -10%, Melee hit +5, Max comfortable temp +45F [25C], Min comfortable temp -9F [-5C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Sucker",
            "Description": "They say a sucker is born every minute, and they are that sucker",
            "Stats": "Trade price improvement -20%",
            "Conflicts": "Amateur Haggler, Haggling Enthusiast, Persuasive"
        },
        {
            "Trait": "Summoner",
            "Description": "Is able to summon beings and materialize objects from other planes of existence",
            "Stats": "Move speed +0.1, Toxic sensitivity +10%, Min comfortable temp -14.4F [-8C], Max comfortable temp +14.4F [8C], Social impact +10%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Super Soldier",
            "Description": "Is a highly trained Soldier, specializing in pistol, shotgun, or rifle weapons. Their weapons specialization is augmented by a standard set of combat training. Super soldiers are trained to be aggressive and consider violence the natural solution to any argument",
            "Stats": "Immunity gain speed +15%, Move speed +0.1, Carrying capacity +20, Pain shock threshold +25%, Aiming time -15%, Social impact -25%, Psychic sensitivity -25%, Global work speed -10%, Global learning factor -20%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Super-immune",
            "Description": "Has a naturally powerful immune system. They will gain immunity much faster than a normal person would, and can survive illnesses with would kill others",
            "Stats": "Immunity gain speed +30%",
            "Conflicts": "Sickly"
        },
        {
            "Trait": "Support Specialist",
            "Description": "Is a verstile, shotgun-toting combay support, capable of taking out key targets, holding the line, or supporting allies",
            "Stats": "aiming time -25%, move speed -0.3, melee hit chance -5, melee dodge chance -5, mental break threshold -18%, shooting accuracy -5, carrying capacity +120",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Sylvanus' Blessing",
            "Description": "Companian to all woodland creatures, both mundane and fantastic, They protect and nurture those that respect their domain",
            "Stats": "Plants +4, Animals +4, Tame animal +100%, Train animal +100%, Plant work speed +100%, Plant harvest yield +200%, Armor - Blunt +100%, Armor - Sharp +120%, Foraged food amount +1"
        },
        {
            "Trait": "Technomancer",
            "Description": "Has learned to see magic and science as two parts of the same force and is able to use arcane power to interface directly with components of technology. They are capable of manipulating objects with advanced mechanics, electronics, or computing it to achieve their goals, but has difficulty interacting with biological systems",
            "Stats": "Social impact -30%, Negotiation ability -20%, Trade price improvement -20%, Tame animal -20%, Train animal -20%, Plant work speed -20%, Plant harvest yield -20%, Global work speed +20%, Global learning factor +20%, Immunity gain factor -6%, Research speed +25%, Psychic sensitivity +20%, Shooting accuracy +5",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Teetotaler",
            "Description": "Abhors the idea of gaining pleasure from chemicals, and avoids alcohol and pleasurable drugs",
            "Conflicts": "Chemical Fascination, Chemical Interest"
        },
        {
            "Trait": "Too young to work",
            "Description": "Is too young to work"
        },
        {
            "Trait": "Too Smart",
            "Description": "Is too smart for their own good. They learn everything much faster than everyone, but can be quite eccentric",
            "Stats": "Global learning factor +75%, Mental break threshold +12%",
            "Conflicts": "Dunce, Fast Learner, Iron-willed, Nervous, Savant, Slow Learner, Steadfast, Volatile"
        },
        {
            "Trait": "Tortured Artist",
            "Description": "Feels alienated and misunderstood by other human beings. They will have a constant mood debuff, but gain a chance (50%) to get a creativity inspiration after a mental break",
            "Stats": "Permanent mood effect -8"
        },
        {
            "Trait": "Tough",
            "Description": "They have thick skin, dense flesh, and durable bones. They take much less damage than other people from the same blows. They are extremely hard to kill",
            "Conflicts": "Ironman, Low Pain Tolerance, Unstoppable, Wimp"
        },
        {
            "Trait": "Transhumanist",
            "Description": "Feels limited in their feeble human body. They often dream of being enhanced by artificial body parts",
            "Conflicts": "Body Purist"
        },
        {
            "Trait": "Trigger-happy",
            "Description": "Pew! Pew! Pew! They just like pulling the trigger. They shoot faster than others, but less accurately",
            "Stats": "aiming time -50%, shooting accuracy -3",
            "Conflicts": "brawler, careful shooter, cranial nerve palsy, deadshot, eagle-eyed, expert shooter"
        },
        {
            "Trait": "Troubadour",
            "Description": "A wandering performer who lifts the spirits of those around them",
            "Stats": "move speed +0.15, social impact +60%, negotiation ability +40%, trade price improvement +60%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Tucker",
            "Description": "That's a lotta graves. Lotta holes to fill. Bow-Chicka-Bow-Wow",
            "Stats": "Social impact +20%",
            "Conflicts": "Awkward, Melodic Voice"
        },
        {
            "Trait": "Ugly",
            "Description": "They are somewhat ugly. This subtly repels others during social interactions",
            "Conflicts": "Beautiful, Pretty, Staggeringly Ugly"
        },
        {
            "Trait": "Unaffected by Death",
            "Description": "Has accepted that death is another part of life and doesn't get upset when learning about a dead ally or seeing one of the undead"
        },
        {
            "Trait": "Uncouth",
            "Description": "Subtle is the game of diplomacy, and subtle, they are not",
            "Stats": "Negotiation ability -20%",
            "Conflicts": "Diplomatic, Very Diplomatic"
        },
        {
            "Trait": "Undead",
            "Description": "Has been reanimated as an undead",
            "Stats": "Move speed -2, Min comfortable temp -360F[-200C], Max comfortable temp +90F[50C], Toxic sensitivity -100%, Immunity gain speed +4900%, Pain shock threshold +90%, Negotiation ability -70%, Global work speed -50%",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Undergrounder",
            "Description": "Has no need to experience the outdoors or light. They will never feel cooped up or get cabin fever, no matter how long they stay inside, and is not bothered by darkness"
        },
        {
            "Trait": "Unstable",
            "Description": "Is more prode to random mood swings, which can be more severe than normal for others"
        },
        {
            "Trait": "Unstoppable",
            "Description": "Has a exceptionally high tolerance for pain. They are unlikely to be immobilized by it",
            "Stats": "Pain shock threshold +65%",
            "Conflicts": "Ironman, Low Pain Tolerance, Tough, Wimp"
        },
        {
            "Trait": "Very Diplomatic",
            "Description": "They have such a way with their wods and gifts that they always manage to cool down a tense situation",
            "Stats": "Negotiation ability +40%",
            "Conflicts": "Diplomatic, Uncouth"
        },
        {
            "Trait": "Very Neurotic",
            "Description": "Feels constantly nervous about everything that has to get done. They will work extremely hard to attain this state of affairs, but their nerves can easily get the better of them",
            "Stats": "Global work speed +40%, Mental break threshold +14%",
            "Conflicts": "Neurotic"
        },
        {
            "Trait": "Volatile",
            "Description": "They are on a hair-trigger all the time. They are the first to break in any tough situation",
            "Stats": "Mental break threshold +15%",
            "Conflicts": "Iron-willed, Nervous, Steadfast, Too Smart"
        },
        {
            "Trait": "Vulcan's Fire",
            "Description": "They craft with fire and forge as an artist would with paint and brush",
            "Stats": "Crafting +4, Construction +4, Construct success +200%, Construction speed +100%, Smithing speed +100%, Smelting speed +100%, Armor - Blunt +100%, Armor - Sharp +120%"
        },
        {
            "Trait": "Wanderer",
            "Description": "They are a wanderer; an outcast, half-breed mage class frequently dubbed a hedge-mage. Their carefree personality has kept them from developing class abilities. Instead, they have learned to improve on a vast number of utility abilities that allow them to adapt to any situation. Wanderers prefer the open road and gain a mood boost for being in a caravan. Caravans with a wanderer will ignore the movement penalties of any world tile. However, the wanderlust will cause them to suvver a mood penalty for remaining at a colony for too long",
            "Stats": "Move speed +0.2, Global work speed -10%, Immunity gain speed +20%, Psychic sensitivity +10%, Mental break threshold -3%, Max comfortable temp +5.4F [3C], Min comfortable temp +5.4F [3C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Warlock",
            "Description": "Able to manifest physical and demonic forces using their unique access to arcane power. The warlock shars the same genetic mixture as a succubus, but as a mal, they are affected with mental enhancements that include clairvoyance and telekineses. The warlock can occasionally affect the outcome of a social interaction using their mental capabilities, regardless of how the interaction actually occurred",
            "Stats": "Move speed -0.1, Global work speed -20%, Immunity gain speed -8%, Social impact +20%, Carrying capacity -20, Global learning factor +25%, Melee dodge -5, Research speed +25%, Melee hit -5, Pain shock threshold -15%, Psychic sensitivity +40%, Max comfortable temp +18F [10C], Min comfortable temp -18F [-10C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Wayfarer",
            "Description": "They are a wayfarer; a self-disciplined fighter that excels at tricks and dirty fighting. Their carefree personality has kept her from developing class abilities. Instead, they have learned to improve a vast number of utility abilities that allow them to adapt to any situation. Wayfarers prefer the open road and will gain a mood boost for being in a caravan, and any caravan with a wayfarer will travel 25% faster. However, wayfarers will suffer a mood penalty if they remain in a colony for too long",
            "Stats": "Move speed +0.2, Global work speed -10%, Immunity gain speed +20%, Psychic sensitivity -10%, Mental break threshold -3%, Max comfortable temp +5.4F [3C], Min comfortable temp +5.4F [3C]",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Weak Constitution",
            "Description": "Is especially vulnerable to diseases, pathogens, and toxic fallout",
            "Stats": "Immunity gain speed -25%, Toxic sensitivity +50%",
            "Conflicts": "Strong Constitution"
        },
        {
            "Trait": "Wimp",
            "Description": "They are weak and cowardly. Even a little pain will immobilize them",
            "Stats": "Pain shock threshold -60%",
            "Conflicts": "Brawler, Ironman, Low Pain Tolerance, Unstoppable"
        },
        {
            "Trait": "Wind Mage",
            "Description": "Capable of bending the very air itself to their will",
            "Stats": "move speed +3, melee dodge chance +20, shooting accuracy +20, aiming time -20%, pain shock threshold -15%, carrying capacity -20",
            "Conflicts": "All other magic traits"
        },
        {
            "Trait": "Woodsman",
            "Description": "They are a trained woodsman; preferring the silence and lethality of a bow and armed with field-craft and cunning, they are prepared to defend their land from invaders",
            "Stats": "Move speed +0.15, Immunity gain speed +20%, Max comfortable temp +18F [10C], Min comfortable temp -18F [-10C], Aiming time -15%, Tosic sensitivity -10%, Butchery speed +5%, Smelting speed -10%, Construction speed -10%, Tame animal +10%, Train animal +10%",
            "Conflicts": "All other Mage traits"
        },
        {
            "Trait": "Xenophile",
            "Description": "They think aliens are exotic and interesting. They would love to get to know them more and wouldn't mind forming relationships with them",
            "Conflicts": "Xenophobe"
        },
        {
            "Trait": "Xenophobe",
            "Description": "They hate and distrust xenos. They see them as little more than animals",
            "Conflicts": "Xenophile"
        }
    ]
}
